GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k42.inc
// Register: DMA1DCNT
#define DMA1DCNT DMA1DCNT
DMA1DCNT                                 equ 03BEAh

// Register: DMA1DCNTL
#define DMA1DCNTL DMA1DCNTL
DMA1DCNTL                                equ 03BEAh
// bitfield definitions
DMA1DCNTL_DCNT_POSN                      equ 0000h
DMA1DCNTL_DCNT_POSITION                  equ 0000h
DMA1DCNTL_DCNT_SIZE                      equ 0008h
DMA1DCNTL_DCNT_LENGTH                    equ 0008h
DMA1DCNTL_DCNT_MASK                      equ 00FFh
DMA1DCNTL_DCNT0_POSN                     equ 0000h
DMA1DCNTL_DCNT0_POSITION                 equ 0000h
DMA1DCNTL_DCNT0_SIZE                     equ 0001h
DMA1DCNTL_DCNT0_LENGTH                   equ 0001h
DMA1DCNTL_DCNT0_MASK                     equ 0001h
DMA1DCNTL_DCNT1_POSN                     equ 0001h
DMA1DCNTL_DCNT1_POSITION                 equ 0001h
DMA1DCNTL_DCNT1_SIZE                     equ 0001h
DMA1DCNTL_DCNT1_LENGTH                   equ 0001h
DMA1DCNTL_DCNT1_MASK                     equ 0002h
DMA1DCNTL_DCNT2_POSN                     equ 0002h
DMA1DCNTL_DCNT2_POSITION                 equ 0002h
DMA1DCNTL_DCNT2_SIZE                     equ 0001h
DMA1DCNTL_DCNT2_LENGTH                   equ 0001h
DMA1DCNTL_DCNT2_MASK                     equ 0004h
DMA1DCNTL_DCNT3_POSN                     equ 0003h
DMA1DCNTL_DCNT3_POSITION                 equ 0003h
DMA1DCNTL_DCNT3_SIZE                     equ 0001h
DMA1DCNTL_DCNT3_LENGTH                   equ 0001h
DMA1DCNTL_DCNT3_MASK                     equ 0008h
DMA1DCNTL_DCNT4_POSN                     equ 0004h
DMA1DCNTL_DCNT4_POSITION                 equ 0004h
DMA1DCNTL_DCNT4_SIZE                     equ 0001h
DMA1DCNTL_DCNT4_LENGTH                   equ 0001h
DMA1DCNTL_DCNT4_MASK                     equ 0010h
DMA1DCNTL_DCNT5_POSN                     equ 0005h
DMA1DCNTL_DCNT5_POSITION                 equ 0005h
DMA1DCNTL_DCNT5_SIZE                     equ 0001h
DMA1DCNTL_DCNT5_LENGTH                   equ 0001h
DMA1DCNTL_DCNT5_MASK                     equ 0020h
DMA1DCNTL_DCNT6_POSN                     equ 0006h
DMA1DCNTL_DCNT6_POSITION                 equ 0006h
DMA1DCNTL_DCNT6_SIZE                     equ 0001h
DMA1DCNTL_DCNT6_LENGTH                   equ 0001h
DMA1DCNTL_DCNT6_MASK                     equ 0040h
DMA1DCNTL_DCNT7_POSN                     equ 0007h
DMA1DCNTL_DCNT7_POSITION                 equ 0007h
DMA1DCNTL_DCNT7_SIZE                     equ 0001h
DMA1DCNTL_DCNT7_LENGTH                   equ 0001h
DMA1DCNTL_DCNT7_MASK                     equ 0080h
DMA1DCNTL_DMA1DCNT_POSN                  equ 0000h
DMA1DCNTL_DMA1DCNT_POSITION              equ 0000h
DMA1DCNTL_DMA1DCNT_SIZE                  equ 0008h
DMA1DCNTL_DMA1DCNT_LENGTH                equ 0008h
DMA1DCNTL_DMA1DCNT_MASK                  equ 00FFh
DMA1DCNTL_DMA1DCNT0_POSN                 equ 0000h
DMA1DCNTL_DMA1DCNT0_POSITION             equ 0000h
DMA1DCNTL_DMA1DCNT0_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT0_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT0_MASK                 equ 0001h
DMA1DCNTL_DMA1DCNT1_POSN                 equ 0001h
DMA1DCNTL_DMA1DCNT1_POSITION             equ 0001h
DMA1DCNTL_DMA1DCNT1_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT1_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT1_MASK                 equ 0002h
DMA1DCNTL_DMA1DCNT2_POSN                 equ 0002h
DMA1DCNTL_DMA1DCNT2_POSITION             equ 0002h
DMA1DCNTL_DMA1DCNT2_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT2_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT2_MASK                 equ 0004h
DMA1DCNTL_DMA1DCNT3_POSN                 equ 0003h
DMA1DCNTL_DMA1DCNT3_POSITION             equ 0003h
DMA1DCNTL_DMA1DCNT3_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT3_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT3_MASK                 equ 0008h
DMA1DCNTL_DMA1DCNT4_POSN                 equ 0004h
DMA1DCNTL_DMA1DCNT4_POSITION             equ 0004h
DMA1DCNTL_DMA1DCNT4_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT4_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT4_MASK                 equ 0010h
DMA1DCNTL_DMA1DCNT5_POSN                 equ 0005h
DMA1DCNTL_DMA1DCNT5_POSITION             equ 0005h
DMA1DCNTL_DMA1DCNT5_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT5_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT5_MASK                 equ 0020h
DMA1DCNTL_DMA1DCNT6_POSN                 equ 0006h
DMA1DCNTL_DMA1DCNT6_POSITION             equ 0006h
DMA1DCNTL_DMA1DCNT6_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT6_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT6_MASK                 equ 0040h
DMA1DCNTL_DMA1DCNT7_POSN                 equ 0007h
DMA1DCNTL_DMA1DCNT7_POSITION             equ 0007h
DMA1DCNTL_DMA1DCNT7_SIZE                 equ 0001h
DMA1DCNTL_DMA1DCNT7_LENGTH               equ 0001h
DMA1DCNTL_DMA1DCNT7_MASK                 equ 0080h

// Register: DMA1DCNTH
#define DMA1DCNTH DMA1DCNTH
DMA1DCNTH                                equ 03BEBh
// bitfield definitions
DMA1DCNTH_DCNT_POSN                      equ 0000h
DMA1DCNTH_DCNT_POSITION                  equ 0000h
DMA1DCNTH_DCNT_SIZE                      equ 0004h
DMA1DCNTH_DCNT_LENGTH                    equ 0004h
DMA1DCNTH_DCNT_MASK                      equ 000Fh
DMA1DCNTH_DCNT8_POSN                     equ 0000h
DMA1DCNTH_DCNT8_POSITION                 equ 0000h
DMA1DCNTH_DCNT8_SIZE                     equ 0001h
DMA1DCNTH_DCNT8_LENGTH                   equ 0001h
DMA1DCNTH_DCNT8_MASK                     equ 0001h
DMA1DCNTH_DCNT9_POSN                     equ 0001h
DMA1DCNTH_DCNT9_POSITION                 equ 0001h
DMA1DCNTH_DCNT9_SIZE                     equ 0001h
DMA1DCNTH_DCNT9_LENGTH                   equ 0001h
DMA1DCNTH_DCNT9_MASK                     equ 0002h
DMA1DCNTH_DCNT10_POSN                    equ 0002h
DMA1DCNTH_DCNT10_POSITION                equ 0002h
DMA1DCNTH_DCNT10_SIZE                    equ 0001h
DMA1DCNTH_DCNT10_LENGTH                  equ 0001h
DMA1DCNTH_DCNT10_MASK                    equ 0004h
DMA1DCNTH_DCNT11_POSN                    equ 0003h
DMA1DCNTH_DCNT11_POSITION                equ 0003h
DMA1DCNTH_DCNT11_SIZE                    equ 0001h
DMA1DCNTH_DCNT11_LENGTH                  equ 0001h
DMA1DCNTH_DCNT11_MASK                    equ 0008h
DMA1DCNTH_DMA1SCNT_POSN                  equ 0000h
DMA1DCNTH_DMA1SCNT_POSITION              equ 0000h
DMA1DCNTH_DMA1SCNT_SIZE                  equ 0004h
DMA1DCNTH_DMA1SCNT_LENGTH                equ 0004h
DMA1DCNTH_DMA1SCNT_MASK                  equ 000Fh
DMA1DCNTH_DMA1DCNT8_POSN                 equ 0000h
DMA1DCNTH_DMA1DCNT8_POSITION             equ 0000h
DMA1DCNTH_DMA1DCNT8_SIZE                 equ 0001h
DMA1DCNTH_DMA1DCNT8_LENGTH               equ 0001h
DMA1DCNTH_DMA1DCNT8_MASK                 equ 0001h
DMA1DCNTH_DMA1DCNT9_POSN                 equ 0001h
DMA1DCNTH_DMA1DCNT9_POSITION             equ 0001h
DMA1DCNTH_DMA1DCNT9_SIZE                 equ 0001h
DMA1DCNTH_DMA1DCNT9_LENGTH               equ 0001h
DMA1DCNTH_DMA1DCNT9_MASK                 equ 0002h
DMA1DCNTH_DMA1DCNT10_POSN                equ 0002h
DMA1DCNTH_DMA1DCNT10_POSITION            equ 0002h
DMA1DCNTH_DMA1DCNT10_SIZE                equ 0001h
DMA1DCNTH_DMA1DCNT10_LENGTH              equ 0001h
DMA1DCNTH_DMA1DCNT10_MASK                equ 0004h
DMA1DCNTH_DMA1DCNT11_POSN                equ 0003h
DMA1DCNTH_DMA1DCNT11_POSITION            equ 0003h
DMA1DCNTH_DMA1DCNT11_SIZE                equ 0001h
DMA1DCNTH_DMA1DCNT11_LENGTH              equ 0001h
DMA1DCNTH_DMA1DCNT11_MASK                equ 0008h

// Register: DMA1DPTR
#define DMA1DPTR DMA1DPTR
DMA1DPTR                                 equ 03BECh

// Register: DMA1DPTRL
#define DMA1DPTRL DMA1DPTRL
DMA1DPTRL                                equ 03BECh
// bitfield definitions
DMA1DPTRL_DPTR_POSN                      equ 0000h
DMA1DPTRL_DPTR_POSITION                  equ 0000h
DMA1DPTRL_DPTR_SIZE                      equ 0008h
DMA1DPTRL_DPTR_LENGTH                    equ 0008h
DMA1DPTRL_DPTR_MASK                      equ 00FFh
DMA1DPTRL_DPTR0_POSN                     equ 0000h
DMA1DPTRL_DPTR0_POSITION                 equ 0000h
DMA1DPTRL_DPTR0_SIZE                     equ 0001h
DMA1DPTRL_DPTR0_LENGTH                   equ 0001h
DMA1DPTRL_DPTR0_MASK                     equ 0001h
DMA1DPTRL_DPTR1_POSN                     equ 0001h
DMA1DPTRL_DPTR1_POSITION                 equ 0001h
DMA1DPTRL_DPTR1_SIZE                     equ 0001h
DMA1DPTRL_DPTR1_LENGTH                   equ 0001h
DMA1DPTRL_DPTR1_MASK                     equ 0002h
DMA1DPTRL_DPTR2_POSN                     equ 0002h
DMA1DPTRL_DPTR2_POSITION                 equ 0002h
DMA1DPTRL_DPTR2_SIZE                     equ 0001h
DMA1DPTRL_DPTR2_LENGTH                   equ 0001h
DMA1DPTRL_DPTR2_MASK                     equ 0004h
DMA1DPTRL_DPTR3_POSN                     equ 0003h
DMA1DPTRL_DPTR3_POSITION                 equ 0003h
DMA1DPTRL_DPTR3_SIZE                     equ 0001h
DMA1DPTRL_DPTR3_LENGTH                   equ 0001h
DMA1DPTRL_DPTR3_MASK                     equ 0008h
DMA1DPTRL_DPTR4_POSN                     equ 0004h
DMA1DPTRL_DPTR4_POSITION                 equ 0004h
DMA1DPTRL_DPTR4_SIZE                     equ 0001h
DMA1DPTRL_DPTR4_LENGTH                   equ 0001h
DMA1DPTRL_DPTR4_MASK                     equ 0010h
DMA1DPTRL_DPTR5_POSN                     equ 0005h
DMA1DPTRL_DPTR5_POSITION                 equ 0005h
DMA1DPTRL_DPTR5_SIZE                     equ 0001h
DMA1DPTRL_DPTR5_LENGTH                   equ 0001h
DMA1DPTRL_DPTR5_MASK                     equ 0020h
DMA1DPTRL_DPTR6_POSN                     equ 0006h
DMA1DPTRL_DPTR6_POSITION                 equ 0006h
DMA1DPTRL_DPTR6_SIZE                     equ 0001h
DMA1DPTRL_DPTR6_LENGTH                   equ 0001h
DMA1DPTRL_DPTR6_MASK                     equ 0040h
DMA1DPTRL_DPTR7_POSN                     equ 0007h
DMA1DPTRL_DPTR7_POSITION                 equ 0007h
DMA1DPTRL_DPTR7_SIZE                     equ 0001h
DMA1DPTRL_DPTR7_LENGTH                   equ 0001h
DMA1DPTRL_DPTR7_MASK                     equ 0080h
DMA1DPTRL_DMA1DPTR_POSN                  equ 0000h
DMA1DPTRL_DMA1DPTR_POSITION              equ 0000h
DMA1DPTRL_DMA1DPTR_SIZE                  equ 0008h
DMA1DPTRL_DMA1DPTR_LENGTH                equ 0008h
DMA1DPTRL_DMA1DPTR_MASK                  equ 00FFh
DMA1DPTRL_DMA1DPTR0_POSN                 equ 0000h
DMA1DPTRL_DMA1DPTR0_POSITION             equ 0000h
DMA1DPTRL_DMA1DPTR0_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR0_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR0_MASK                 equ 0001h
DMA1DPTRL_DMA1DPTR1_POSN                 equ 0001h
DMA1DPTRL_DMA1DPTR1_POSITION             equ 0001h
DMA1DPTRL_DMA1DPTR1_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR1_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR1_MASK                 equ 0002h
DMA1DPTRL_DMA1DPTR2_POSN                 equ 0002h
DMA1DPTRL_DMA1DPTR2_POSITION             equ 0002h
DMA1DPTRL_DMA1DPTR2_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR2_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR2_MASK                 equ 0004h
DMA1DPTRL_DMA1DPTR3_POSN                 equ 0003h
DMA1DPTRL_DMA1DPTR3_POSITION             equ 0003h
DMA1DPTRL_DMA1DPTR3_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR3_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR3_MASK                 equ 0008h
DMA1DPTRL_DMA1DPTR4_POSN                 equ 0004h
DMA1DPTRL_DMA1DPTR4_POSITION             equ 0004h
DMA1DPTRL_DMA1DPTR4_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR4_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR4_MASK                 equ 0010h
DMA1DPTRL_DMA1DPTR5_POSN                 equ 0005h
DMA1DPTRL_DMA1DPTR5_POSITION             equ 0005h
DMA1DPTRL_DMA1DPTR5_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR5_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR5_MASK                 equ 0020h
DMA1DPTRL_DMA1DPTR6_POSN                 equ 0006h
DMA1DPTRL_DMA1DPTR6_POSITION             equ 0006h
DMA1DPTRL_DMA1DPTR6_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR6_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR6_MASK                 equ 0040h
DMA1DPTRL_DMA1DPTR7_POSN                 equ 0007h
DMA1DPTRL_DMA1DPTR7_POSITION             equ 0007h
DMA1DPTRL_DMA1DPTR7_SIZE                 equ 0001h
DMA1DPTRL_DMA1DPTR7_LENGTH               equ 0001h
DMA1DPTRL_DMA1DPTR7_MASK                 equ 0080h

// Register: DMA1DPTRH
#define DMA1DPTRH DMA1DPTRH
DMA1DPTRH                                equ 03BEDh
// bitfield definitions
DMA1DPTRH_DPTR_POSN                      equ 0000h
DMA1DPTRH_DPTR_POSITION                  equ 0000h
DMA1DPTRH_DPTR_SIZE                      equ 0008h
DMA1DPTRH_DPTR_LENGTH                    equ 0008h
DMA1DPTRH_DPTR_MASK                      equ 00FFh
DMA1DPTRH_DPTR8_POSN                     equ 0000h
DMA1DPTRH_DPTR8_POSITION                 equ 0000h
DMA1DPTRH_DPTR8_SIZE                     equ 0001h
DMA1DPTRH_DPTR8_LENGTH                   equ 0001h
DMA1DPTRH_DPTR8_MASK                     equ 0001h
DMA1DPTRH_DPTR9_POSN                     equ 0001h
DMA1DPTRH_DPTR9_POSITION                 equ 0001h
DMA1DPTRH_DPTR9_SIZE                     equ 0001h
DMA1DPTRH_DPTR9_LENGTH                   equ 0001h
DMA1DPTRH_DPTR9_MASK                     equ 0002h
DMA1DPTRH_DPTR10_POSN                    equ 0002h
DMA1DPTRH_DPTR10_POSITION                equ 0002h
DMA1DPTRH_DPTR10_SIZE                    equ 0001h
DMA1DPTRH_DPTR10_LENGTH                  equ 0001h
DMA1DPTRH_DPTR10_MASK                    equ 0004h
DMA1DPTRH_DPTR11_POSN                    equ 0003h
DMA1DPTRH_DPTR11_POSITION                equ 0003h
DMA1DPTRH_DPTR11_SIZE                    equ 0001h
DMA1DPTRH_DPTR11_LENGTH                  equ 0001h
DMA1DPTRH_DPTR11_MASK                    equ 0008h
DMA1DPTRH_DPTR12_POSN                    equ 0004h
DMA1DPTRH_DPTR12_POSITION                equ 0004h
DMA1DPTRH_DPTR12_SIZE                    equ 0001h
DMA1DPTRH_DPTR12_LENGTH                  equ 0001h
DMA1DPTRH_DPTR12_MASK                    equ 0010h
DMA1DPTRH_DPTR13_POSN                    equ 0005h
DMA1DPTRH_DPTR13_POSITION                equ 0005h
DMA1DPTRH_DPTR13_SIZE                    equ 0001h
DMA1DPTRH_DPTR13_LENGTH                  equ 0001h
DMA1DPTRH_DPTR13_MASK                    equ 0020h
DMA1DPTRH_DPTR14_POSN                    equ 0006h
DMA1DPTRH_DPTR14_POSITION                equ 0006h
DMA1DPTRH_DPTR14_SIZE                    equ 0001h
DMA1DPTRH_DPTR14_LENGTH                  equ 0001h
DMA1DPTRH_DPTR14_MASK                    equ 0040h
DMA1DPTRH_DPTR15_POSN                    equ 0007h
DMA1DPTRH_DPTR15_POSITION                equ 0007h
DMA1DPTRH_DPTR15_SIZE                    equ 0001h
DMA1DPTRH_DPTR15_LENGTH                  equ 0001h
DMA1DPTRH_DPTR15_MASK                    equ 0080h
DMA1DPTRH_DMA1DPTR_POSN                  equ 0000h
DMA1DPTRH_DMA1DPTR_POSITION              equ 0000h
DMA1DPTRH_DMA1DPTR_SIZE                  equ 0008h
DMA1DPTRH_DMA1DPTR_LENGTH                equ 0008h
DMA1DPTRH_DMA1DPTR_MASK                  equ 00FFh
DMA1DPTRH_DMA1DPTR8_POSN                 equ 0000h
DMA1DPTRH_DMA1DPTR8_POSITION             equ 0000h
DMA1DPTRH_DMA1DPTR8_SIZE                 equ 0001h
DMA1DPTRH_DMA1DPTR8_LENGTH               equ 0001h
DMA1DPTRH_DMA1DPTR8_MASK                 equ 0001h
DMA1DPTRH_DMA1DPTR9_POSN                 equ 0001h
DMA1DPTRH_DMA1DPTR9_POSITION             equ 0001h
DMA1DPTRH_DMA1DPTR9_SIZE                 equ 0001h
DMA1DPTRH_DMA1DPTR9_LENGTH               equ 0001h
DMA1DPTRH_DMA1DPTR9_MASK                 equ 0002h
DMA1DPTRH_DMA1DPTR10_POSN                equ 0002h
DMA1DPTRH_DMA1DPTR10_POSITION            equ 0002h
DMA1DPTRH_DMA1DPTR10_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR10_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR10_MASK                equ 0004h
DMA1DPTRH_DMA1DPTR11_POSN                equ 0003h
DMA1DPTRH_DMA1DPTR11_POSITION            equ 0003h
DMA1DPTRH_DMA1DPTR11_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR11_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR11_MASK                equ 0008h
DMA1DPTRH_DMA1DPTR12_POSN                equ 0004h
DMA1DPTRH_DMA1DPTR12_POSITION            equ 0004h
DMA1DPTRH_DMA1DPTR12_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR12_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR12_MASK                equ 0010h
DMA1DPTRH_DMA1DPTR13_POSN                equ 0005h
DMA1DPTRH_DMA1DPTR13_POSITION            equ 0005h
DMA1DPTRH_DMA1DPTR13_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR13_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR13_MASK                equ 0020h
DMA1DPTRH_DMA1DPTR14_POSN                equ 0006h
DMA1DPTRH_DMA1DPTR14_POSITION            equ 0006h
DMA1DPTRH_DMA1DPTR14_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR14_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR14_MASK                equ 0040h
DMA1DPTRH_DMA1DPTR15_POSN                equ 0007h
DMA1DPTRH_DMA1DPTR15_POSITION            equ 0007h
DMA1DPTRH_DMA1DPTR15_SIZE                equ 0001h
DMA1DPTRH_DMA1DPTR15_LENGTH              equ 0001h
DMA1DPTRH_DMA1DPTR15_MASK                equ 0080h

// Register: DMA1DSZ
#define DMA1DSZ DMA1DSZ
DMA1DSZ                                  equ 03BEEh

// Register: DMA1DSZL
#define DMA1DSZL DMA1DSZL
DMA1DSZL                                 equ 03BEEh
// bitfield definitions
DMA1DSZL_DSZ_POSN                        equ 0000h
DMA1DSZL_DSZ_POSITION                    equ 0000h
DMA1DSZL_DSZ_SIZE                        equ 0008h
DMA1DSZL_DSZ_LENGTH                      equ 0008h
DMA1DSZL_DSZ_MASK                        equ 00FFh
DMA1DSZL_DMA1DSZ_POSN                    equ 0000h
DMA1DSZL_DMA1DSZ_POSITION                equ 0000h
DMA1DSZL_DMA1DSZ_SIZE                    equ 0008h
DMA1DSZL_DMA1DSZ_LENGTH                  equ 0008h
DMA1DSZL_DMA1DSZ_MASK                    equ 00FFh
DMA1DSZL_DSZ0_POSN                       equ 0000h
DMA1DSZL_DSZ0_POSITION                   equ 0000h
DMA1DSZL_DSZ0_SIZE                       equ 0001h
DMA1DSZL_DSZ0_LENGTH                     equ 0001h
DMA1DSZL_DSZ0_MASK                       equ 0001h
DMA1DSZL_DSZ1_POSN                       equ 0001h
DMA1DSZL_DSZ1_POSITION                   equ 0001h
DMA1DSZL_DSZ1_SIZE                       equ 0001h
DMA1DSZL_DSZ1_LENGTH                     equ 0001h
DMA1DSZL_DSZ1_MASK                       equ 0002h
DMA1DSZL_DSZ2_POSN                       equ 0002h
DMA1DSZL_DSZ2_POSITION                   equ 0002h
DMA1DSZL_DSZ2_SIZE                       equ 0001h
DMA1DSZL_DSZ2_LENGTH                     equ 0001h
DMA1DSZL_DSZ2_MASK                       equ 0004h
DMA1DSZL_DSZ3_POSN                       equ 0003h
DMA1DSZL_DSZ3_POSITION                   equ 0003h
DMA1DSZL_DSZ3_SIZE                       equ 0001h
DMA1DSZL_DSZ3_LENGTH                     equ 0001h
DMA1DSZL_DSZ3_MASK                       equ 0008h
DMA1DSZL_DSZ4_POSN                       equ 0004h
DMA1DSZL_DSZ4_POSITION                   equ 0004h
DMA1DSZL_DSZ4_SIZE                       equ 0001h
DMA1DSZL_DSZ4_LENGTH                     equ 0001h
DMA1DSZL_DSZ4_MASK                       equ 0010h
DMA1DSZL_DSZ5_POSN                       equ 0005h
DMA1DSZL_DSZ5_POSITION                   equ 0005h
DMA1DSZL_DSZ5_SIZE                       equ 0001h
DMA1DSZL_DSZ5_LENGTH                     equ 0001h
DMA1DSZL_DSZ5_MASK                       equ 0020h
DMA1DSZL_DSZ6_POSN                       equ 0006h
DMA1DSZL_DSZ6_POSITION                   equ 0006h
DMA1DSZL_DSZ6_SIZE                       equ 0001h
DMA1DSZL_DSZ6_LENGTH                     equ 0001h
DMA1DSZL_DSZ6_MASK                       equ 0040h
DMA1DSZL_DSZ7_POSN                       equ 0007h
DMA1DSZL_DSZ7_POSITION                   equ 0007h
DMA1DSZL_DSZ7_SIZE                       equ 0001h
DMA1DSZL_DSZ7_LENGTH                     equ 0001h
DMA1DSZL_DSZ7_MASK                       equ 0080h
DMA1DSZL_DMA1DSZ0_POSN                   equ 0000h
DMA1DSZL_DMA1DSZ0_POSITION               equ 0000h
DMA1DSZL_DMA1DSZ0_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ0_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ0_MASK                   equ 0001h
DMA1DSZL_DMA1DSZ1_POSN                   equ 0001h
DMA1DSZL_DMA1DSZ1_POSITION               equ 0001h
DMA1DSZL_DMA1DSZ1_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ1_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ1_MASK                   equ 0002h
DMA1DSZL_DMA1DSZ2_POSN                   equ 0002h
DMA1DSZL_DMA1DSZ2_POSITION               equ 0002h
DMA1DSZL_DMA1DSZ2_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ2_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ2_MASK                   equ 0004h
DMA1DSZL_DMA1DSZ3_POSN                   equ 0003h
DMA1DSZL_DMA1DSZ3_POSITION               equ 0003h
DMA1DSZL_DMA1DSZ3_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ3_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ3_MASK                   equ 0008h
DMA1DSZL_DMA1DSZ4_POSN                   equ 0004h
DMA1DSZL_DMA1DSZ4_POSITION               equ 0004h
DMA1DSZL_DMA1DSZ4_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ4_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ4_MASK                   equ 0010h
DMA1DSZL_DMA1DSZ5_POSN                   equ 0005h
DMA1DSZL_DMA1DSZ5_POSITION               equ 0005h
DMA1DSZL_DMA1DSZ5_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ5_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ5_MASK                   equ 0020h
DMA1DSZL_DMA1DSZ6_POSN                   equ 0006h
DMA1DSZL_DMA1DSZ6_POSITION               equ 0006h
DMA1DSZL_DMA1DSZ6_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ6_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ6_MASK                   equ 0040h
DMA1DSZL_DMA1DSZ7_POSN                   equ 0007h
DMA1DSZL_DMA1DSZ7_POSITION               equ 0007h
DMA1DSZL_DMA1DSZ7_SIZE                   equ 0001h
DMA1DSZL_DMA1DSZ7_LENGTH                 equ 0001h
DMA1DSZL_DMA1DSZ7_MASK                   equ 0080h

